n-ways-to-fizz-buzz-clj.org
#+TITLE: n ways to FizzBuzz in Clojure
#+SUBTITLE: (Or, How to Stop Worrying and Start Decomplecting.)
#+AUTHOR: Aditya Athalye
#+EMAIL: fizzbuzz@evalapply.org
#+DATE: 2022-03-26 Sat
#+STARTUP: beamer
#+STARTUP: latexpreview
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Antibes
#+OPTIONS: H:2 num:t toc:nil
#+OPTIONS: \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS: TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)
* Intro
** Demo Clojure concepts & stdlib via FizzBuzz
   - *The Demo Plan*: pray to Demogods and...
     - Do rapid-fire live demo, until timer runs out
     - Where each FizzBuzz has reason to exist
     - And /"decomplect"/ is said so often you think it's normal
   #+Beamer: \pause
   - *The Demofail Plan*: Blog post (may also upload video)
   #+Beamer: \pause
   - *The Actual Plan*: Drop some sizzlin' hot takes. Leik dis...

  #+begin_verse
  If you do FP right, you get OOP for free and vice-versa.
  #Smalltalk #Clojure #Erlang #OCaml #Haskell
  - Yours Truly :)
  #+end_verse
* Prayer
** O Lambda the Ultimate, bless we who are in this demo...
    #+begin_verse
    That our core be functional,
      and our functions be pure.
    That our data be immutable,
      so we may know the value of values.
    That our systems be composable,
      so they may scale with grace.
    That their States only mutate
      in pleasantly surprising ways.
    That the networks and servers stay up.
      Well, at least through this demo.

    For otherwise, nothing lives, nothing evolves.

    In the name of the \alpha and the \beta and the \eta...
      \(\lambda x.x x\) \(\lambda x.x x\) ; eternally
   #+end_verse
* Definitions
** Definitions
   - *FizzBuzz*
   #+begin_quote
   Fizz buzz is a group word game for children
   to teach them about division. Players take
   turns to count incrementally, replacing any
   number divisible by ~THREE~ with the word
   "Fizz", and any number divisible by ~FIVE~
   with the word "Buzz". /- Wikipedia/
   #+end_quote
   #+Beamer: \pause
   - *"Numbers"*: Natural Numbers starting at 1
   #+Beamer: \pause
   - */Clojurish/*: postmodern revival of
     Latin roots of US English
     - /complect/      : braided, entwined, hopelessly
     - /complected/    : Thing that makes Clojurian frown.
     - /decomplect/    : unbraid, disentwine
     - /decomplected/  : Thing that makes Clojurian smile.
     - /decomplecting/ : Activity that Clojurian enjoys.
                        (coming up!)
* A Classic
** Le FizzBuzz Classique: First try
   - Accidentally discover /~for~/ in stdlib
   - "Ooh, List Comprehension. Nice!"
     (- The Python gentlenerds in the house :)
     #+Beamer: \pause
     #+begin_src clojure
     (ns user)
     (defn fizz-buzz-classic
       [num-xs]
       (for [n num-xs]
         (cond
           (zero? (rem n 15)) (println "FizzBuzz")
           (zero? (rem n 3)) (println "Fizz")
           (zero? (rem n 5)) (println "Buzz")
           :else (println n))))
     #+end_src
     #+Beamer: \pause
   - Those pesky nils, tho.. (see REPL console)
** Le FizzBuzz Classique est mort à Clojure
   Désolé :(

   - /~for~/ is Lazy

   - REPL is eager

   - Here be Dragons

   - Unlearn old habits

   - Or learn from prod outage
** Le FizzBuzz Classique: Remedied
   No more /~println~/, no more nils.
   #+begin_src clojure
     (defn lazybuzz
       [num-xs]
       (for [n num-xs]
         (cond
           (zero? (rem n 15)) "FizzBuzz"
           (zero? (rem n 3)) "Fizz"
           (zero? (rem n 5)) "Buzz"
           :else n)))

     (lazybuzz [1 3 5 15 16]) ; yes

     (fizz-buzz-classic [1 3 5 15 19]) ; bleh
   #+end_src
** Le FizzBuzz Classique: dissected
   - "Classic" FizzBuzz considered harmful (in Clojure)

   - Examine & avoid its severe defects:
     - *Broken behaviour*
       - calculations functional
       - ~println~ non-deterministic

     - *Broken API contract*
       - "Classic" version returns useless nils
       - ~lazybuzz~ returns useful values
       - We like useful values

     - *Broken time model*
       - Effects ("do NOW") + Laziness ("maybe never") = Bad!
       - Define separately, join later in safe ways

     - *Broken aesthetic*
       - Do one job, do it well. Printing is /second/ job.
       - "That's George's problem." - Hal & Gerry

   - Bonus: See blog post for ideas to get /fired/ with fizzbuzz.
** Le FizzBuzz Classique: resurrected, the Clojure way
   - Keep your fns pure, like ~lazybuzz~

   - Laziness becomes friend, as nice bonus!
     (Recall the children's game definition)
     #+begin_src clojure :results raw
       (def all-naturals (rest (range)))
       (def all-fizz-buzzes (lazybuzz all-naturals))
     #+end_src

   - Let REPL print. Separately.
     #+begin_src clojure :results raw
     (take 15 all-fizz-buzzes)
     #+end_src
* decomplect choice
** decomplect sequence-making v/s choice-making
   - Lift out logic as its own definition
     - "Do one thing well"
       #+begin_src clojure :results raw
       (defn basic-buzz [n]
         (cond
           (divisible? n 15) "FizzBuzz"
           (divisible? n 3) "Fizz"
           (divisible? n 5) "Buzz"
           :else n))
       #+end_src
     - Retain composability with ~for~
       #+begin_src clojure
       (def all-fizz-buzzes
         (for [n (rest (range))]
           (basic-buzz n)))
       #+end_src
     - /And/ open up design space
       #+begin_src clojure
         (def all-fizz-buzzes
           (map basic-buzz (rest (range))))
       #+end_src
     - ~reduce~ is homework (lazy v/s eager)
* decomplect CPU
** decomplect execution (CPU-bound parallelism)
   - Almost too embarrassing to write...
     #+begin_src clojure
       (def fizz-buzz map)
       (def par-buzz pmap)
     #+end_src
   - Get CPU-bound parallelism trivially...
     #+begin_src clojure
       (= (fizz-buzz basic-buzz (range 1 101))
          (par-buzz basic-buzz (range 1 101)))
     #+end_src
   - Not too hard to understand!
     #+begin_src clojure
       (clojure.repl/source pmap)
     #+end_src
* decomplect domain: solution side as well as problem side
** decomplect domain: solution side as well as problem side
   - "Solution side" => the language of the domain
     - Function names
     - APIs and contracts
     - Domain abstractions and entity relationships
   - "Problem side" => the nature of the domain
     - Direct ("declarative") expression of middle-school maths
     - Pry apart the "what" from the "how"
