n-ways-to-fizz-buzz-clj.tex
% Created 2022-04-05 Tue 11:55
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{Antibes}
\author{Aditya Athalye}
\date{2022-03-26 Sat}
\title{n ways to FizzBuzz in Clojure}
\subtitle{(Or, How to Stop Worrying and Start Decomplecting.)}
\hypersetup{
 pdfauthor={Aditya Athalye},
 pdftitle={n ways to FizzBuzz in Clojure},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3.7)},
 pdflang={English}}
\begin{document}

\maketitle
\section{Intro}
\label{sec:org62bc719}
\begin{frame}[label={sec:org6be44f6}]{Demo Clojure concepts \& stdlib via FizzBuzz}
\begin{itemize}
\item \alert{The Demo Plan}: pray to Demogods and\ldots{}
\begin{itemize}
\item Do rapid-fire live demo, until timer runs out
\item Where each FizzBuzz has reason to exist
\item And \emph{"decomplect"} is said so often you think it's normal
\end{itemize}
\end{itemize}
\pause
\begin{itemize}
\item \alert{The Demofail Plan}: Blog post (may also upload video)
\end{itemize}
\pause
\begin{itemize}
\item \alert{The Actual Plan}: Drop some sizzlin' hot takes. Leik dis\ldots{}
\end{itemize}

\begin{verse}
If you do FP right, you get OOP for free and vice-versa.\\
\#Smalltalk \#Clojure \#Erlang \#OCaml \#Haskell\\
- Yours Truly :)\\
\end{verse}
\end{frame}
\section{Prayer}
\label{sec:org80416a7}
\begin{frame}[label={sec:orge09d711}]{O Lambda the Ultimate, bless we who are in this demo\ldots{}}
\begin{verse}
That our core be functional,\\
\hspace*{2em}and our functions be pure.\\
That our data be immutable,\\
\hspace*{2em}so we may know the value of values.\\
That our systems be composable,\\
\hspace*{2em}so they may scale with grace.\\
That their States only mutate\\
\hspace*{2em}in pleasantly surprising ways.\\
That the networks and servers stay up.\\
\hspace*{2em}Well, at least through this demo.\\
\vspace*{1em}
For otherwise, nothing lives, nothing evolves.\\
\vspace*{1em}
In the name of the \(\alpha\) and the \(\beta\) and the \(\eta\)\ldots{}\\
\hspace*{2em}(\(\lambda\)x.x x) (\(\lambda\)x.x x) ; eternally\\
\end{verse}
\end{frame}
\section{Definitions}
\label{sec:org1cbf7d2}
\begin{frame}[label={sec:orgaba8d91},fragile]{Definitions}
 \begin{itemize}
\item \alert{FizzBuzz}
\end{itemize}
\begin{quote}
Fizz buzz is a group word game for children
to teach them about division. Players take
turns to count incrementally, replacing any
number divisible by \texttt{THREE} with the word
"Fizz", and any number divisible by \texttt{FIVE}
with the word "Buzz". \emph{- Wikipedia}
\end{quote}
\pause
\begin{itemize}
\item \alert{"Numbers"}: Natural Numbers starting at 1
\end{itemize}
\pause
\begin{itemize}
\item \alert{\emph{Clojurish}}: postmodern revival of
Latin roots of US English
\begin{itemize}
\item \emph{complect}      : braided, entwined, hopelessly
\item \emph{complected}    : Thing that makes Clojurian frown.
\item \emph{decomplect}    : unbraid, disentwine
\item \emph{decomplected}  : Thing that makes Clojurian smile.
\item \emph{decomplecting} : Activity that Clojurian enjoys.
(coming up!)
\end{itemize}
\end{itemize}
\end{frame}
\section{A Classic}
\label{sec:org1f2beca}
\begin{frame}[label={sec:orgaeb2465},fragile]{Le FizzBuzz Classique: First try}
 \begin{itemize}
\item Accidentally discover \emph{\texttt{for}} in stdlib
\item "Ooh, List Comprehension. Nice!"
(- The Python gentlenerds in the house :)
\pause
\begin{verbatim}
(ns user)
(defn fizz-buzz-classic
  [num-xs]
  (for [n num-xs]
    (cond
      (zero? (rem n 15)) (println "FizzBuzz")
      (zero? (rem n 3)) (println "Fizz")
      (zero? (rem n 5)) (println "Buzz")
      :else (println n))))
\end{verbatim}
\pause
\item Those pesky nils, tho.. (see REPL console)
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org401141f},fragile]{Le FizzBuzz Classique est mort à Clojure}
 Désolé :(

\begin{itemize}
\item \emph{\texttt{for}} is Lazy

\item REPL is eager

\item Here be Dragons

\item Unlearn old habits

\item Or learn from prod outage
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgd4a6253},fragile]{Le FizzBuzz Classique: Remedied}
 No more \emph{\texttt{println}}, no more nils.
\begin{verbatim}
(defn lazybuzz
  [num-xs]
  (for [n num-xs]
    (cond
      (zero? (rem n 15)) "FizzBuzz"
      (zero? (rem n 3)) "Fizz"
      (zero? (rem n 5)) "Buzz"
      :else n)))

(lazybuzz [1 3 5 15 16]) ; yes

(fizz-buzz-classic [1 3 5 15 19]) ; bleh
\end{verbatim}
\end{frame}
\begin{frame}[label={sec:orgb707d02},fragile]{Le FizzBuzz Classique: dissected}
 \begin{itemize}
\item "Classic" FizzBuzz considered harmful (in Clojure)

\item Examine \& avoid its severe defects:
\begin{itemize}
\item \alert{Broken behaviour}
\begin{itemize}
\item calculations functional
\item \texttt{println} non-deterministic
\end{itemize}

\item \alert{Broken API contract}
\begin{itemize}
\item "Classic" version returns useless nils
\item \texttt{lazybuzz} returns useful values
\item We like useful values
\end{itemize}

\item \alert{Broken time model}
\begin{itemize}
\item Effects ("do NOW") + Laziness ("maybe never") = Bad!
\item Define separately, join later in safe ways
\end{itemize}

\item \alert{Broken aesthetic}
\begin{itemize}
\item Do one job, do it well. Printing is \emph{second} job.
\item "That's George's problem." - Hal \& Gerry
\end{itemize}
\end{itemize}

\item Bonus: See blog post for ideas to get \emph{fired} with fizzbuzz.
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgf26ca7d},fragile]{Le FizzBuzz Classique: resurrected, the Clojure way}
 \begin{itemize}
\item Keep your fns pure, like \texttt{lazybuzz}

\item Laziness becomes friend, as nice bonus!
(Recall the children's game definition)
\begin{verbatim}
(def all-naturals (rest (range)))
(def all-fizz-buzzes (lazybuzz all-naturals))
\end{verbatim}

\item Let REPL print. Separately.
\begin{verbatim}
(take 15 all-fizz-buzzes)
\end{verbatim}
\end{itemize}
\end{frame}
\section{decomplect choice}
\label{sec:orgb43e970}
\begin{frame}[label={sec:orgd9693b6},fragile]{decomplect sequence-making v/s choice-making}
 \begin{itemize}
\item Lift out logic as its own definition
\begin{itemize}
\item "Do one thing well"
\begin{verbatim}
(defn basic-buzz [n]
  (cond
    (divisible? n 15) "FizzBuzz"
    (divisible? n 3) "Fizz"
    (divisible? n 5) "Buzz"
    :else n))
\end{verbatim}
\item Retain composability with \texttt{for}
\begin{verbatim}
(def all-fizz-buzzes
  (for [n (rest (range))]
    (basic-buzz n)))
\end{verbatim}
\item \emph{And} open up design space
\begin{verbatim}
(def all-fizz-buzzes
  (map basic-buzz (rest (range))))
\end{verbatim}
\item \texttt{reduce} is homework (lazy v/s eager)
\end{itemize}
\end{itemize}
\end{frame}
\section{decomplect CPU}
\label{sec:org060b8b9}
\begin{frame}[label={sec:orgef7b39f},fragile]{decomplect execution (CPU-bound parallelism)}
 \begin{itemize}
\item Almost too embarrassing to write\ldots{}
\begin{verbatim}
(def fizz-buzz map)
(def par-buzz pmap)
\end{verbatim}
\item Get CPU-bound parallelism trivially\ldots{}
\begin{verbatim}
(= (fizz-buzz basic-buzz (range 1 101))
   (par-buzz basic-buzz (range 1 101)))
\end{verbatim}
\item Not too hard to understand!
\begin{verbatim}
(clojure.repl/source pmap)
\end{verbatim}
\end{itemize}
\end{frame}
\section{decomplect domain: solution side as well as problem side}
\label{sec:orgac55a0f}
\begin{frame}[label={sec:org4be9531}]{decomplect domain: solution side as well as problem side}
\begin{itemize}
\item "Solution side" => the language of the domain
\begin{itemize}
\item Function names
\item APIs and contracts
\item Domain abstractions and entity relationships
\end{itemize}
\item "Problem side" => the nature of the domain
\begin{itemize}
\item Direct ("declarative") expression of middle-school maths
\item Pry apart the "what" from the "how"
\end{itemize}
\end{itemize}
\end{frame}
