n-ways-to-fizz-buzz-clj.org
** decomplect solution domain (concept of divisibility)
   - Name locally or lift to top level?
     - We can let-bind a lambda
       #+begin_src clojure
         (defn letbuzz [num-xs]
           (for [n num-xs]
             (let [divisible? (fn [n1 n2] (zero? (rem n1 n2)))]
               (cond
                 (divisible? n 15) "FizzBuzz"
                 (divisible? n 3) "Fizz"
                 (divisible? n 5) "Buzz"
                 :else n))))
        #+end_src
     - But we like tiny fns that add compositional firepower
       #+begin_src clojure
         (defn divisible? [n1 n2]
           (zero? (rem n1 n2)))

         (def divisible? (comp zero? rem))
       #+end_src
   - All 3 variants are refrentially transparent
** decomplect solution domain more (language of fizzbuzz)
   - Open up design space more with more domain concepts
     #+begin_src clojure
       (defn divisible?
         "Return the-word (truthy) when n divisible,
         nil otherwise (falsey)."
         [divisor the-word n]
         (when (zero? (rem n divisor))
           the-word))

       (def fizzes? (partial divisible? 3 "Fizz"))
       (def buzzes? (partial divisible? 5 "Buzz"))
       (def fizzbuzzes? (partial divisible? 15 "FizzBuzz"))
     #+end_src
   - Note:
     - Truthiness/falseyness
     - args list ordered as more constant -to-> more variable
** decomplect solution domain more (language of fizzbuzz)
   - Now we can do /~or~/ buzz
     - /~or~/ is short-circuiting
       #+begin_src clojure
       (defn or-buzz [n]
         (or (fizzbuzzes? n)
             (buzzes? n)
             (fizzes? n)
             n))
       #+end_src
   - Or, /~juxt~/ express our choice
     - given /~((juxt f g h) 42)~ -> ~[(f 42) (g 42) (h 42)]~/
       #+begin_src clojure
         (defn juxt-buzz [n]
           (some identity
                 ((juxt fizzbuzzes? buzzes? fizzes? identity)
                  n)))
       #+end_src
     - Here ~juxt~ is too subtle for production, BUT useful later
   - Sadly, order of conditionals still matters in both cases
** decomplect problem domain (school maths, 15 is LCM)
   - Make order of calculation /not/ matter
   - A table of remainders of 15, in a hash-map
     #+begin_src clojure
     (def rem15->fizz-buzz
       {0  "FizzBuzz"
        3  "Fizz"
        6  "Fizz"
        9  "Fizz"
        12 "Fizz"
        5  "Buzz"
        10 "Buzz"})
     #+end_src
   - Maps are functions too!
     #+begin_src clojure
     (rem15->fizz-buzz (rem 3 15))
     ;; ~nil~ implies "no result found"
     (rem15->fizz-buzz (rem 1 15))
     #+end_src
** decomplect problem domain (school maths, 15 is LCM)
   - ~nil~-pun with short-circuiting *~or~*
     #+begin_src clojure
     (defn or-rem15-buzz
       [n]
       (or (rem15->fizz-buzz (rem n 15))
           n))
     #+end_src

   - But *~get~* is more right, with fallback for "not found"
     #+begin_src clojure
     (defn get-rem15-buzz
       [n]
       (get rem15->fizz-buzz
            (rem n 15)
            n))
     #+end_src

   - And we can do
     #+begin_src clojure
       (fizz-buzz get-rem15-n (range 1 16))
     #+end_src
** decomplect problem domain more (modulo math)
   - FizzBuzz cyclical in modulo 3, 5, 15
     #+begin_src clojure
       (def mod-cycle-buzz ; sequence ordered by definition
         (let [n  identity
               f  (constantly "Fizz")
               b  (constantly "Buzz")
               fb (constantly "FizzBuzz")]
           (cycle [n n f n b f n n f b n f n n fb])))
     #+end_src
   - Map can operate over ~n~ collections.
     #+begin_src clojure
       (def all-fizz-buzzes
         (map (fn [f n] (f n))
              mod-cycle-buzz ; countless modulo pattern
              (rest (range)))) ; countless natural numbers
     #+end_src
** decomplect ALL the FizzBuzzes (prime factors)
   - Think prime factors and modulo cycles
     - e.g. ~[nil nil "Fizz"]~, ~[nil nil nil nil "Buzz"]~
       #+begin_src clojure
         (defn any-mod-cycle-buzz
           [num & words]
           (or (not-empty (reduce str words))
               num))
       #+end_src
     - Recall /~map~/ is variadic, so bring on all the primes!
       #+begin_src clojure
         (map any-mod-cycle-buzz
              (range 1 16)
              (cycle [nil nil "Fizz"])
              (cycle [nil nil nil nil "Buzz"])
              (cycle [nil "Biz"])
              (cycle [nil nil nil nil nil nil "Fuz"]))
       #+end_src
     - Bonus: get /~identity~/ (~I~) definition too:
       ~I~ of ~+~ is 0, ~I~ of ~*~ is 1, ~I~ of ~FizzBuzz~ is all naturals
       #+begin_src clojure
         (map any-mod-cycle-buzz (range 1 16))
       #+end_src
* decomplect /mechanism/ and /policy/
** decomplect /mechanism/ and /policy/ (Say what?)
   - Classically, "mechanism" and "policy" hard-wired together
     #+begin_src org
       <-- ------- MECHANISM -------- -->|<-- POLICY -->

       | n divisible? 3 | n divisible? 5 | Final value |
       |----------------+----------------+-------------|
       | true           | true           | FizzBuzz    |
       | true           | false          | Fizz        |
       | false          | true           | Buzz        |
       | false          | false          | n           |
     #+end_src
** decomplect /mechanism/ and /policy/ (pry the two apart)
   - *Mechanism*: the way to construct /a/ truth table
     #+begin_src clojure
       (ns dispatch.buzz)
       (defn mechanism
         "Given two fns, presumably of any-to->Boolean,
          return a fn that can construct inputs of a
          2-input truth table."
         [f? g?]
         (juxt f? g?))
     #+end_src
   - *Policy*: the way to calculate Fizz Buzz
     #+begin_src clojure
       (defn divisible? [divisor n]
         (zero? (rem n divisor)))

       (def fizzes? (partial divisible? 3))
       (def buzzes? (partial divisible? 5))
     #+end_src
** decomplect /mechanism/ and /policy/ (recompose a-la-carte)
   - *Mechanism + Policy*: Polymorphic dispatch joins
     truth table mechanism with FizzBuzz policy
     - Key: specialise the truth table mechanism to FizzBuzz
       #+begin_src clojure
         (map (mechanism fizzes? buzzes?)
              [15 3 5 1])
       #+end_src
   - Use in dispatch mechanism
     - connect truth table rows to results
       #+begin_src clojure
         (def fizz-buzz map)
         (def fizz-buzz-mecha (mechanism fizzes? buzzes?))
         (defmulti dispatch-buzz
           "Each method yields result record
           for truth table record."
           fizz-buzz-mecha)
       #+end_src
** decomplect /mechanism/ and /policy/ (recompose a-la-carte)
   - *Mechanism + Policy*: Yes, 'tis a wee FizzBuzz interpreter!
     #+begin_src clojure
       (defmethod dispatch-buzz [true true]
         [n]
         "FizzBuzz")
       (defmethod dispatch-buzz [true false]
         [n]
         "Fizz")
       (defmethod dispatch-buzz [false true]
         [n]
         "Buzz")
       (defmethod dispatch-buzz :default
         [n]
         n)
       (fizz-buzz dispatch-buzz [1 3 5 15 16])
     #+end_src
* decomplect OOP
** decomplect OOP: What is complected?
   Classical OOP complects these things:
   - Name (Class name / Java type)
   - Structure (Class members, methods etc.)
   - Behaviour (effects caused by methods)
   - State (contained in the run-time instance of the Class)
