n-ways-to-fizz-buzz-clj.tex
\begin{frame}[label={sec:org4627a71},fragile]{decomplect solution domain (concept of divisibility)}
 \begin{itemize}
\item Name locally or lift to top level?
\begin{itemize}
\item We can let-bind a lambda
\begin{verbatim}
(defn letbuzz [num-xs]
  (for [n num-xs]
    (let [divisible? (fn [n1 n2] (zero? (rem n1 n2)))]
      (cond
        (divisible? n 15) "FizzBuzz"
        (divisible? n 3) "Fizz"
        (divisible? n 5) "Buzz"
        :else n))))
\end{verbatim}
\item But we like tiny fns that add compositional firepower
\begin{verbatim}
(defn divisible? [n1 n2]
  (zero? (rem n1 n2)))

(def divisible? (comp zero? rem))
\end{verbatim}
\end{itemize}
\item All 3 variants are refrentially transparent
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orga37e5c2},fragile]{decomplect solution domain more (language of fizzbuzz)}
 \begin{itemize}
\item Open up design space more with more domain concepts
\begin{verbatim}
(defn divisible?
  "Return the-word (truthy) when n divisible,
  nil otherwise (falsey)."
  [divisor the-word n]
  (when (zero? (rem n divisor))
    the-word))

(def fizzes? (partial divisible? 3 "Fizz"))
(def buzzes? (partial divisible? 5 "Buzz"))
(def fizzbuzzes? (partial divisible? 15 "FizzBuzz"))
\end{verbatim}
\item Note:
\begin{itemize}
\item Truthiness/falseyness
\item args list ordered as more constant -to-> more variable
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgc8cad74},fragile]{decomplect solution domain more (language of fizzbuzz)}
 \begin{itemize}
\item Now we can do \emph{\texttt{or}} buzz
\begin{itemize}
\item \emph{\texttt{or}} is short-circuiting
\begin{verbatim}
(defn or-buzz [n]
  (or (fizzbuzzes? n)
      (buzzes? n)
      (fizzes? n)
      n))
\end{verbatim}
\end{itemize}
\item Or, \emph{\texttt{juxt}} express our choice
\begin{itemize}
\item given \emph{\texttt{((juxt f g h) 42)} -> \texttt{[(f 42) (g 42) (h 42)]}}
\begin{verbatim}
(defn juxt-buzz [n]
  (some identity
        ((juxt fizzbuzzes? buzzes? fizzes? identity)
         n)))
\end{verbatim}
\item Here \texttt{juxt} is too subtle for production, BUT useful later
\end{itemize}
\item Sadly, order of conditionals still matters in both cases
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org9629f8b},fragile]{decomplect problem domain (school maths, 15 is LCM)}
 \begin{itemize}
\item Make order of calculation \emph{not} matter
\item A table of remainders of 15, in a hash-map
\begin{verbatim}
(def rem15->fizz-buzz
  {0  "FizzBuzz"
   3  "Fizz"
   6  "Fizz"
   9  "Fizz"
   12 "Fizz"
   5  "Buzz"
   10 "Buzz"})
\end{verbatim}
\item Maps are functions too!
\begin{verbatim}
(rem15->fizz-buzz (rem 3 15))
;; ~nil~ implies "no result found"
(rem15->fizz-buzz (rem 1 15))
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org5aae148},fragile]{decomplect problem domain (school maths, 15 is LCM)}
 \begin{itemize}
\item \texttt{nil}-pun with short-circuiting \alert{\texttt{or}}
\begin{verbatim}
(defn or-rem15-buzz
  [n]
  (or (rem15->fizz-buzz (rem n 15))
      n))
\end{verbatim}

\item But \alert{\texttt{get}} is more right, with fallback for "not found"
\begin{verbatim}
(defn get-rem15-buzz
  [n]
  (get rem15->fizz-buzz
       (rem n 15)
       n))
\end{verbatim}

\item And we can do
\begin{verbatim}
(fizz-buzz get-rem15-n (range 1 16))
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orge65911d},fragile]{decomplect problem domain more (modulo math)}
 \begin{itemize}
\item FizzBuzz cyclical in modulo 3, 5, 15
\begin{verbatim}
(def mod-cycle-buzz ; sequence ordered by definition
  (let [n  identity
        f  (constantly "Fizz")
        b  (constantly "Buzz")
        fb (constantly "FizzBuzz")]
    (cycle [n n f n b f n n f b n f n n fb])))
\end{verbatim}
\item Map can operate over \texttt{n} collections.
\begin{verbatim}
(def all-fizz-buzzes
  (map (fn [f n] (f n))
       mod-cycle-buzz ; countless modulo pattern
       (rest (range)))) ; countless natural numbers
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orge3d262c},fragile]{decomplect ALL the FizzBuzzes (prime factors)}
 \begin{itemize}
\item Think prime factors and modulo cycles
\begin{itemize}
\item e.g. \texttt{[nil nil "Fizz"]}, \texttt{[nil nil nil nil "Buzz"]}
\begin{verbatim}
(defn any-mod-cycle-buzz
  [num & words]
  (or (not-empty (reduce str words))
      num))
\end{verbatim}
\item Recall \emph{\texttt{map}} is variadic, so bring on all the primes!
\begin{verbatim}
(map any-mod-cycle-buzz
     (range 1 16)
     (cycle [nil nil "Fizz"])
     (cycle [nil nil nil nil "Buzz"])
     (cycle [nil "Biz"])
     (cycle [nil nil nil nil nil nil "Fuz"]))
\end{verbatim}
\item Bonus: get \emph{\texttt{identity}} (\texttt{I}) definition too:
\texttt{I} of \texttt{+} is 0, \texttt{I} of \texttt{*} is 1, \texttt{I} of \texttt{FizzBuzz} is all naturals
\begin{verbatim}
(map any-mod-cycle-buzz (range 1 16))
\end{verbatim}
\end{itemize}
\end{itemize}
\end{frame}
\section{decomplect \emph{mechanism} and \emph{policy}}
\label{sec:org81aebbb}
\begin{frame}[label={sec:org2eda929},fragile]{decomplect \emph{mechanism} and \emph{policy} (Say what?)}
 \begin{itemize}
\item Classically, "mechanism" and "policy" hard-wired together
\begin{verbatim}
<-- ------- MECHANISM -------- -->|<-- POLICY -->

| n divisible? 3 | n divisible? 5 | Final value |
|----------------+----------------+-------------|
| true           | true           | FizzBuzz    |
| true           | false          | Fizz        |
| false          | true           | Buzz        |
| false          | false          | n           |
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org91ec3d5},fragile]{decomplect \emph{mechanism} and \emph{policy} (pry the two apart)}
 \begin{itemize}
\item \alert{Mechanism}: the way to construct \emph{a} truth table
\begin{verbatim}
(ns dispatch.buzz)
(defn mechanism
  "Given two fns, presumably of any-to->Boolean,
   return a fn that can construct inputs of a
   2-input truth table."
  [f? g?]
  (juxt f? g?))
\end{verbatim}
\item \alert{Policy}: the way to calculate Fizz Buzz
\begin{verbatim}
(defn divisible? [divisor n]
  (zero? (rem n divisor)))

(def fizzes? (partial divisible? 3))
(def buzzes? (partial divisible? 5))
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org46a9058},fragile]{decomplect \emph{mechanism} and \emph{policy} (recompose a-la-carte)}
 \begin{itemize}
\item \alert{Mechanism + Policy}: Polymorphic dispatch joins
truth table mechanism with FizzBuzz policy
\begin{itemize}
\item Key: specialise the truth table mechanism to FizzBuzz
\begin{verbatim}
(map (mechanism fizzes? buzzes?)
     [15 3 5 1])
\end{verbatim}
\end{itemize}
\item Use in dispatch mechanism
\begin{itemize}
\item connect truth table rows to results
\begin{verbatim}
(def fizz-buzz map)
(def fizz-buzz-mecha (mechanism fizzes? buzzes?))
(defmulti dispatch-buzz
  "Each method yields result record
  for truth table record."
  fizz-buzz-mecha)
\end{verbatim}
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orge4cc296},fragile]{decomplect \emph{mechanism} and \emph{policy} (recompose a-la-carte)}
 \begin{itemize}
\item \alert{Mechanism + Policy}: Yes, 'tis a wee FizzBuzz interpreter!
\begin{verbatim}
(defmethod dispatch-buzz [true true]
  [n]
  "FizzBuzz")
(defmethod dispatch-buzz [true false]
  [n]
  "Fizz")
(defmethod dispatch-buzz [false true]
  [n]
  "Buzz")
(defmethod dispatch-buzz :default
  [n]
  n)
(fizz-buzz dispatch-buzz [1 3 5 15 16])
\end{verbatim}
\end{itemize}
\end{frame}
\section{decomplect OOP}
\label{sec:orge77f11f}
\begin{frame}[label={sec:org18fbbad}]{decomplect OOP: What is complected?}
Classical OOP complects these things:
\begin{itemize}
\item Name (Class name / Java type)
\item Structure (Class members, methods etc.)
\item Behaviour (effects caused by methods)
\item State (contained in the run-time instance of the Class)
\end{itemize}
\end{frame}
