n-ways-to-fizz-buzz-clj.org
** decomplect OOP: with Clojure Polymorphism
   - Bring back usual suspects
     #+begin_src clojure
       (ns oops.fizzbuzz)
       (def divisible? (comp zero? rem))
       (def fizz-buzz map)
       (defn basic-buzz [n]
         (cond
           (divisible? n 15) "FizzBuzz"
           (divisible? n 3) "Fizz"
           (divisible? n 5) "Buzz"
           :else n))
     #+end_src
   - Introduce protocols (like Java Interfaces, but better)
     #+begin_src clojure
       (defprotocol IFizzBuzz
         (proto-buzz [this]))
     #+end_src
** decomplect OOP: with Clojure Polymorphism
   - Add new behaviour to existing types including /any/ Java builtin
       #+begin_src clojure
         (extend-protocol IFizzBuzz
           java.lang.Number
           (proto-buzz [this]
             (basic-buzz this)))
       #+end_src
   - Like this: Java type-based Polymorphic dispatch
     #+begin_src clojure :results raw
       (fizz-buzz proto-buzz [1 3 5 15 16])
       (fizz-buzz proto-buzz [1.0 3.0 5.0 15.0 15.9])
     #+end_src
** decomplect OOP: with Clojure Polymorphism
   - Clojure protocols cleanly solve the _/[[https://en.wikipedia.org/wiki/Expression_problem][Expression Problem]]/_
   - /*Without*/ breaking Equality or any other existing semantics
     #+begin_src clojure
       (= 42 42) ; => true (long and long)
       (= 42 42.0) ; => false (long and double)
       (= 42.0 42.0) ; => true (double and double)

       ;; False, as it should be.
       (= (fizz-buzz proto-buzz [1 3 5 15 16])
          (fizz-buzz proto-buzz [1.0 3.0 5.0 15.0 15.9]))
     #+end_src
   - Without performance overhead (JVM hotspot optimization)
* decomplect information (nondestructive fizzbuzz)
** decomplect information (nondestructive fizzbuzz)
   - All fizz-buzzes so far /lose information/
   - Can't undo entropy
   - Very Very Bad (especially in an age of plentiful memory)
   - We can FizzBuzz with "Composite" Data
** decomplect information (Peano arithmetic representation)
   - Define PeanoBuzz number representation starting at ~[0 0]~
   - PeanoBuzz is closed under this definition of Successor (/~S~/)
     #+begin_src clojure
       (def S (comp (juxt identity get-rem15-buzz)
                    inc
                    first))
       (def all-peano-buzzes (iterate S [0 0]))
     #+end_src
   - This is nondestructive (we don't lose our Numbers)
     #+begin_src clojure
       (take 16 all-peano-buzzes)
     #+end_src
   - Trivially map PeanoBuzz back to Standard FizzBuzz
     #+begin_src clojure
       (= (fizz-buzz basic-buzz (range 1 101))
          (fizz-buzz second
                     (take 100 (rest all-peano-buzzes))))
     #+end_src
** decomplect information (Records to represent FizzBuzz)
   - Records provide Java Types + all generic hash-map properties
     #+begin_src clojure
       (ns boxed.fizz.buzz)
       (defrecord Fizz [n])
       (defrecord Buzz [n])
       (defrecord FizzBuzz [n])
       (defrecord Identity [n])
     #+end_src
** decomplect information (Records to represent FizzBuzz)
   - Boxed variant of ~basic-buzz~
     #+begin_src clojure
       (def divisible? (comp zero? rem))
       (def fizz-buzz map)

       (defn boxed-buzz [n]
         (cond
           (divisible? n 15) (->FizzBuzz n)
           (divisible? n 3) (->Fizz n)
           (divisible? n 5) (->Buzz n)
           :else (->Identity n)))

       (def all-boxed-buzzes
         (map boxed-buzz (rest (range))))
     #+end_src
** decomplect information (Records to represent FizzBuzz)
   - Composite hash-map-like data!
     #+begin_src clojure
       (= (fizz-buzz boxed-buzz [1 3 5 15])
          [#boxed.fizz.buzz.Identity{:n 1}
           #boxed.fizz.buzz.Fizz{:n 3}
           #boxed.fizz.buzz.Buzz{:n 5}
           #boxed.fizz.buzz.FizzBuzz{:n 15}])
     #+end_src
   - Which is nondestructive!!
     #+begin_src clojure
       (= [1 3 5 15]
          (fizz-buzz (comp :n boxed-buzz) [1 3 5 15]))
     #+end_src
   - /And/ which has real Java types!!!
     #+begin_src clojure
       (= (map type (fizz-buzz boxed-buzz [1 3 5 15]))
          [boxed.fizz.buzz.Identity
           boxed.fizz.buzz.Fizz
           boxed.fizz.buzz.Buzz
           boxed.fizz.buzz.FizzBuzz])
   #+end_src
* decomplect context (whence a number FizzBuzzes)
** decomplect context (whence a number FizzBuzzes)
   - Context thus far was run-time calculation
     - Meaning embedded in in-line logic
     - Not optional / situational by default
   - Some ideas to pull out FizzBuzz interpretation /context/
     - Super handy in /some/ situations
     - Utility is is contextual
** decomplect context (parse, don't calculate or interpret)
   - Off-label use of _[[https://clojure.org/guides/spec][Clojure Spec_]]'s /~conform~/ as parser
   - Skirts the "can be a very bad idea" territory. YMMV.
     #+begin_src clojure
       (ns conformer.buzz)
       (require '[clojure.spec.alpha :as s])

       (defn divisible? [divisor n]
         (zero? (rem n divisor)))
       (def fizzes? (partial divisible? 3))
       (def buzzes? (partial divisible? 5))

       (s/def ::number number?)
       (s/def ::fizzes (s/and ::number fizzes?))
       (s/def ::buzzes (s/and ::number buzzes?))
     #+end_src
** decomplect context (parse, don't calculate or interpret)
   - Now we can parse input data...
     #+begin_src clojure
       (s/conform ::fizzes 3) ; 3
       (s/conform ::buzzes 5) ; 5
       (s/conform ::buzzes 3) ; :clojure.spec.alpha/invalid
       (s/conform (s/and ::fizzes ::buzzes) 15) ; 15
     #+end_src
   - /And/ handle non-conforming data gracefully,
     instead of panicking and throwing exceptions
     #+begin_src clojure
       (s/conform (s/or ::fizzes ::buzzes) "lol")
       ;; => :clojure.spec.alpha/invalid
     #+end_src
** decomplect context (parse, don't calculate or interpret)
   - Relate numbers, parsers, parser results
   - Set of FizzBuzz parsers
     #+begin_src clojure
     (def fizz-buzz-specs #{::fizzes ::buzzes ::number})
     #+end_src
   - Parser-accumulator
     #+begin_src clojure
       (defn spec-parse-buzz [x]
         [x (zipmap fizz-buzz-specs
                    (map #(s/conform % x) fizz-buzz-specs))])
     #+end_src
     - Which describes parse result in a tuple
       #+begin_src clojure
         ;; e.g. (spec-parse-buzz 1)
         [1 #:conformer.buzz{:fizzes :clojure.spec.alpha/invalid,
                             :buzzes :clojure.spec.alpha/invalid,
                             :number 1}]
       #+end_src
** decomplect context (parse, don't calculate or interpret)
   - Accumulate parser results like this
     #+begin_src clojure
     (into {} (map spec-parse-buzz [3 15 "lol"]))
     #+end_src
     - A hash-map with number assoc'd with parse result
       #+begin_src clojure
         {3
          #:conformer.buzz{:fizzes 3,
                           :buzzes :clojure.spec.alpha/invalid,
                           :number 3},
          15
          #:conformer.buzz{:fizzes 15,
                           :buzzes 15,
                           :number 15},
          "lol"
          #:conformer.buzz{:fizzes :clojure.spec.alpha/invalid,
                           :buzzes :clojure.spec.alpha/invalid,
                           :number :clojure.spec.alpha/invalid}}
       #+end_src
** decomplect context (wicked pprint Buzz)
   #+begin_verse
     /"Let no number escape fizzbuzzness when showing itself."/

     - _[[https://twitter.com/rdivyanshu][@rdivyanshu]]_

     (Truly a genetlenerd and a scholar.)
   #+end_verse
