n-ways-to-fizz-buzz-clj.tex
\begin{frame}[label={sec:orgdcce424},fragile]{decomplect OOP: with Clojure Polymorphism}
 \begin{itemize}
\item Bring back usual suspects
\begin{verbatim}
(ns oops.fizzbuzz)
(def divisible? (comp zero? rem))
(def fizz-buzz map)
(defn basic-buzz [n]
  (cond
    (divisible? n 15) "FizzBuzz"
    (divisible? n 3) "Fizz"
    (divisible? n 5) "Buzz"
    :else n))
\end{verbatim}
\item Introduce protocols (like Java Interfaces, but better)
\begin{verbatim}
(defprotocol IFizzBuzz
  (proto-buzz [this]))
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgf1eb234},fragile]{decomplect OOP: with Clojure Polymorphism}
 \begin{itemize}
\item Add new behaviour to existing types including \emph{any} Java builtin
\begin{verbatim}
(extend-protocol IFizzBuzz
  java.lang.Number
  (proto-buzz [this]
    (basic-buzz this)))
\end{verbatim}
\item Like this: Java type-based Polymorphic dispatch
\begin{verbatim}
(fizz-buzz proto-buzz [1 3 5 15 16])
(fizz-buzz proto-buzz [1.0 3.0 5.0 15.0 15.9])
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orga0b0dec},fragile]{decomplect OOP: with Clojure Polymorphism}
 \begin{itemize}
\item Clojure protocols cleanly solve the \uline{\emph{\href{https://en.wikipedia.org/wiki/Expression\_problem}{Expression Problem}}}
\item \emph{\alert{Without}} breaking Equality or any other existing semantics
\begin{verbatim}
(= 42 42) ; => true (long and long)
(= 42 42.0) ; => false (long and double)
(= 42.0 42.0) ; => true (double and double)

;; False, as it should be.
(= (fizz-buzz proto-buzz [1 3 5 15 16])
   (fizz-buzz proto-buzz [1.0 3.0 5.0 15.0 15.9]))
\end{verbatim}
\item Without performance overhead (JVM hotspot optimization)
\end{itemize}
\end{frame}
\section{decomplect information (nondestructive fizzbuzz)}
\label{sec:org3bdf635}
\begin{frame}[label={sec:org0426aee}]{decomplect information (nondestructive fizzbuzz)}
\begin{itemize}
\item All fizz-buzzes so far \emph{lose information}
\item Can't undo entropy
\item Very Very Bad (especially in an age of plentiful memory)
\item We can FizzBuzz with "Composite" Data
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org64d507b},fragile]{decomplect information (Peano arithmetic representation)}
 \begin{itemize}
\item Define PeanoBuzz number representation starting at \texttt{[0 0]}
\item PeanoBuzz is closed under this definition of Successor (\emph{\texttt{S}})
\begin{verbatim}
(def S (comp (juxt identity get-rem15-buzz)
             inc
             first))
(def all-peano-buzzes (iterate S [0 0]))
\end{verbatim}
\item This is nondestructive (we don't lose our Numbers)
\begin{verbatim}
(take 16 all-peano-buzzes)
\end{verbatim}
\item Trivially map PeanoBuzz back to Standard FizzBuzz
\begin{verbatim}
(= (fizz-buzz basic-buzz (range 1 101))
   (fizz-buzz second
              (take 100 (rest all-peano-buzzes))))
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org02c3153},fragile]{decomplect information (Records to represent FizzBuzz)}
 \begin{itemize}
\item Records provide Java Types + all generic hash-map properties
\begin{verbatim}
(ns boxed.fizz.buzz)
(defrecord Fizz [n])
(defrecord Buzz [n])
(defrecord FizzBuzz [n])
(defrecord Identity [n])
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgd5c1533},fragile]{decomplect information (Records to represent FizzBuzz)}
 \begin{itemize}
\item Boxed variant of \texttt{basic-buzz}
\begin{verbatim}
(def divisible? (comp zero? rem))
(def fizz-buzz map)

(defn boxed-buzz [n]
  (cond
    (divisible? n 15) (->FizzBuzz n)
    (divisible? n 3) (->Fizz n)
    (divisible? n 5) (->Buzz n)
    :else (->Identity n)))

(def all-boxed-buzzes
  (map boxed-buzz (rest (range))))
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org0ea2c92},fragile]{decomplect information (Records to represent FizzBuzz)}
 \begin{itemize}
\item Composite hash-map-like data!
\begin{verbatim}
(= (fizz-buzz boxed-buzz [1 3 5 15])
   [#boxed.fizz.buzz.Identity{:n 1}
    #boxed.fizz.buzz.Fizz{:n 3}
    #boxed.fizz.buzz.Buzz{:n 5}
    #boxed.fizz.buzz.FizzBuzz{:n 15}])
\end{verbatim}
\item Which is nondestructive!!
\begin{verbatim}
(= [1 3 5 15]
   (fizz-buzz (comp :n boxed-buzz) [1 3 5 15]))
\end{verbatim}
\item \emph{And} which has real Java types!!!
\begin{verbatim}
(= (map type (fizz-buzz boxed-buzz [1 3 5 15]))
   [boxed.fizz.buzz.Identity
    boxed.fizz.buzz.Fizz
    boxed.fizz.buzz.Buzz
    boxed.fizz.buzz.FizzBuzz])
\end{verbatim}
\end{itemize}
\end{frame}
\section{decomplect context (whence a number FizzBuzzes)}
\label{sec:orgac0c86a}
\begin{frame}[label={sec:org0d6376c}]{decomplect context (whence a number FizzBuzzes)}
\begin{itemize}
\item Context thus far was run-time calculation
\begin{itemize}
\item Meaning embedded in in-line logic
\item Not optional / situational by default
\end{itemize}
\item Some ideas to pull out FizzBuzz interpretation \emph{context}
\begin{itemize}
\item Super handy in \emph{some} situations
\item Utility is is contextual
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org73848a5},fragile]{decomplect context (parse, don't calculate or interpret)}
 \begin{itemize}
\item Off-label use of \_\href{https://clojure.org/guides/spec}{Clojure Spec\_}'s \emph{\texttt{conform}} as parser
\item Skirts the "can be a very bad idea" territory. YMMV.
\begin{verbatim}
(ns conformer.buzz)
(require '[clojure.spec.alpha :as s])

(defn divisible? [divisor n]
  (zero? (rem n divisor)))
(def fizzes? (partial divisible? 3))
(def buzzes? (partial divisible? 5))

(s/def ::number number?)
(s/def ::fizzes (s/and ::number fizzes?))
(s/def ::buzzes (s/and ::number buzzes?))
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgbec344a},fragile]{decomplect context (parse, don't calculate or interpret)}
 \begin{itemize}
\item Now we can parse input data\ldots{}
\begin{verbatim}
(s/conform ::fizzes 3) ; 3
(s/conform ::buzzes 5) ; 5
(s/conform ::buzzes 3) ; :clojure.spec.alpha/invalid
(s/conform (s/and ::fizzes ::buzzes) 15) ; 15
\end{verbatim}
\item \emph{And} handle non-conforming data gracefully,
instead of panicking and throwing exceptions
\begin{verbatim}
(s/conform (s/or ::fizzes ::buzzes) "lol")
;; => :clojure.spec.alpha/invalid
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgda6109e},fragile]{decomplect context (parse, don't calculate or interpret)}
 \begin{itemize}
\item Relate numbers, parsers, parser results
\item Set of FizzBuzz parsers
\begin{verbatim}
(def fizz-buzz-specs #{::fizzes ::buzzes ::number})
\end{verbatim}
\item Parser-accumulator
\begin{verbatim}
(defn spec-parse-buzz [x]
  [x (zipmap fizz-buzz-specs
             (map #(s/conform % x) fizz-buzz-specs))])
\end{verbatim}
\begin{itemize}
\item Which describes parse result in a tuple
\begin{verbatim}
;; e.g. (spec-parse-buzz 1)
[1 #:conformer.buzz{:fizzes :clojure.spec.alpha/invalid,
                    :buzzes :clojure.spec.alpha/invalid,
                    :number 1}]
\end{verbatim}
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org0f15e6c},fragile]{decomplect context (parse, don't calculate or interpret)}
 \begin{itemize}
\item Accumulate parser results like this
\begin{verbatim}
(into {} (map spec-parse-buzz [3 15 "lol"]))
\end{verbatim}
\begin{itemize}
\item A hash-map with number assoc'd with parse result
\begin{verbatim}
{3
 #:conformer.buzz{:fizzes 3,
                  :buzzes :clojure.spec.alpha/invalid,
                  :number 3},
 15
 #:conformer.buzz{:fizzes 15,
                  :buzzes 15,
                  :number 15},
 "lol"
 #:conformer.buzz{:fizzes :clojure.spec.alpha/invalid,
                  :buzzes :clojure.spec.alpha/invalid,
                  :number :clojure.spec.alpha/invalid}}
\end{verbatim}
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orge9b0802}]{decomplect context (wicked pprint Buzz)}
\begin{verse}
\emph{"Let no number escape fizzbuzzness when showing itself."}\\
\vspace*{1em}
- \uline{\href{https://twitter.com/rdivyanshu}{@rdivyanshu}}\\
\vspace*{1em}
(Truly a genetlenerd and a scholar.)\\
\end{verse}
\end{frame}
