n-ways-to-fizz-buzz-clj.org
** decomplect context (wicked pprint Buzz)
   - Write a plain ol' function to pretty-print custom format
     #+begin_src clojure
       (ns pprint.buzz)
       (require '[clojure.pprint :as pp])
       (defn pprint-buzz [n]
         (let [divisible? (comp zero? rem)
               prettyprint
               (comp prn (partial format "%d doth %s"))]
           (cond
             (divisible? n 15) (prettyprint n "FizzBuzzeth")
             (divisible? n 3) (prettyprint n "Fizzeth")
             (divisible? n 5) (prettyprint n "Buzzeth")
             :else (prettyprint n
                                "not Fizzeth nor Buzzeth"))))
     #+end_src
** decomplect context (wicked pprint Buzz)
   - Hotpatch [[https://github.com/clojure/clojure/blob/b1b88dd25373a86e41310a525a21b497799dbbf2/src/clj/clojure/pprint/dispatch.clj#L175][pprint dispatcher]] to
     use ~pprint-buzz~ formatter for all Numbers!
     #+begin_src clojure
       (#'pp/use-method pp/simple-dispatch
                        java.lang.Number
                        pprint-buzz)
     #+end_src
   - Enjoy a nondestructive, hilarious FizzBuzz experience!
     #+begin_src clojure
       (doseq [n [1 3 5 15]] (pp/pprint n)) ;; see REPL :)
     #+end_src
   - This is a joke implementation of a serious idea...
     pretty-printing data is open, fully extensible, and
     can be done (and undone) in a live runtime.
* Suddenly, Transducers
** decomplect what, now? (Suddenly, Transducers.)
   You:
   #+begin_quote
   /Uh, what more could we possibly decomplect?/
   #+end_quote
   Clojure:
   #+begin_quote
   (whatever, input -> whatever) -> (whatever, input -> whatever)
   #+end_quote
   Rich Hickey:
   #+begin_quote
   _/[[https://www.youtube.com/watch?v=6mTbuzafcII&t=1677s][Seems like a good project for the bar, later on.]]/_
   #+end_quote
** decomplect what, now? (Suddenly, Transducers.)
   - Data source
     - sequence, stream, channel, socket etc.
   - Data sink
     - sequence, stream, channel, socket etc.
   - Data transformer
     - function of any value -> any other value
   - Data transformation process
     - mapping, filtering, reducing etc.
   - Some process control
     - Transduce finite data (of course)
     - Transduce streams
     - With optional early termination in either case
** decomplect whatever (some setup)
   - Bring back the usual suspects (this is key... reuse logic)
     #+begin_src clojure
       (ns transducery.buzz)

       (def divisible? (comp zero? rem))

       (defn basic-buzz [n]
         (cond
           (divisible? n 15) "FizzBuzz"
           (divisible? n 3) "Fizz"
           (divisible? n 5) "Buzz"
           :else n))
     #+end_src
** decomplect Computation and /Output/ format (Demo 1)
   - Separately define /only/ the transformation "xform"
     #+begin_src clojure
     (def fizz-buzz-xform
       (comp (map basic-buzz)
             (take 100))) ;; early termination
     #+end_src
   - Separately define /only/ input data
     #+begin_src clojure
     (def natural-nums (rest (range)))
     #+end_src
** decomplect Computation and /Output/ format (Demo 1)
   - Compose in various ways
     - To produce a sequence
       #+begin_src clojure
         (transduce fizz-buzz-xform ;; calculator step
                    conj ;; output method
                    []   ;; output sink
                    natural-nums) ;; input source
       #+end_src
     - To produce a string
       #+begin_src clojure
         (transduce fizz-buzz-xform
                    str
                    ""
                    natural-nums)
       #+end_src
     - To produce a CSV string
       #+begin_src clojure
         (transduce (comp fizz-buzz-xform
                          (map #(str s "," %)))
                    str
                    ""
                    natural-nums)
       #+end_src
** decomplect Computation and /Output/ format (Demo 1)
   - Consider:
     - Parts /not/ modified, though /output/ and/or /xform/ modded
     - Effort needed to reuse fizz-buzzes other than ~basic-buzz~?
   - Try it!
** decomplect Computation and /Input/ format (Demo 2)
   - Setup
     #+begin_src clojure
       (ns transducery.buzz)
       (def numbers-file
         "Plaintext file containing numbers in some format."
         "/tmp/deleteme-spat-by-clj-fizz-buzz-demo.txt")
       #_(spit numbers-file
               (clojure.string/join "\n" (range 1 10001)))
       #_(slurp numbers-file)
   #+end_src
** decomplect Computation and /Input/ format (Demo 2)
   - Transduce! Now, over file data.
     #+begin_src clojure
       (transduce (comp (map #(Integer/parseInt %))
                        fizz-buzz-xform) ;; calculator step
                  conj ;; output method
                  []   ;; output sink
                  (clojure.string/split-lines
                   (slurp numbers-file))) ;; input source
     #+end_src
   - Split-lines and file slurpin' still complected!!!
     - decomplect clues in Tim Baldridge's (excellent) _[[https://tbaldridge.pivotshare.com/categories/transducers/2426/media][tutorials]]_
** decomplected xform as a standalone calculator (Demo 3)
   - The xform can still calculate just a single item
     #+begin_src clojure
     (ns transducery.buzz)
     ((fizz-buzz-xform conj) [] 3) ;; => ["Fizz"]
     ((fizz-buzz-xform str) "" 3) ;; => "Fizz"
     ((fizz-buzz-xform str) "" 1) ;; => "1"
     ((fizz-buzz-xform (fn [_ out] out)) nil 3) ;; "Fizz"
     ((fizz-buzz-xform (fn [_ out] out)) nil 1) ;; 1
     #+end_src
   - Meditate:
     - The transducer's mandate of /a la carte/ re-composition /demands/
       that /all/ the new pulling apart /must be fully compatible/
       with /all/ the old pulling apart.
* Fin
** So Long And Thanks For All The \lambda{}s
   - Acknowledgements
     #+begin_verse
     To everyone who reviewed drafts, gave
     feedback, ideas, encouragement, time...
     ... friends, fellow Clojurian Slack-ers,
     sundry gentlenerds, one's better half,
     and you dear reader.

     May the Source be with you.

     \(\lambda\) ~<3~
     #+end_verse
   - Blog post: _[[https://www.evalapply.org/posts/n-ways-to-fizzbuzz-in-clojure/][evalapply.org/posts/n-ways-to-fizzbuzz-in-clojure]]_
   - Email complaints or fizzbuzzes to
     - fizzbuzz@evalapply.org
** TODO Buzz
   Ideas on deck, to put self on the hook...

   - [ ] curried fizzbuzz (like Ring libraries),

   - [ ] concurrent fizzbuzz (with agents)

   - [ ] advanced transducing fizzbuzz
         (xform all the fizz-buzzes in all ways)

   - [ ] Maaaybe re-do Rich's ants sim
         4 species of, ah, ConcurrAnts:
         FizzAnt, BuzzAnt, FizzBuzzAnt, IdentiAnt

   - [ ] Outside of clojure.core?
         maaybe core.async if not too contrived
