n-ways-to-fizz-buzz-clj.tex
\begin{frame}[label={sec:org164e993},fragile]{decomplect context (wicked pprint Buzz)}
 \begin{itemize}
\item Write a plain ol' function to pretty-print custom format
\begin{verbatim}
(ns pprint.buzz)
(require '[clojure.pprint :as pp])
(defn pprint-buzz [n]
  (let [divisible? (comp zero? rem)
        prettyprint
        (comp prn (partial format "%d doth %s"))]
    (cond
      (divisible? n 15) (prettyprint n "FizzBuzzeth")
      (divisible? n 3) (prettyprint n "Fizzeth")
      (divisible? n 5) (prettyprint n "Buzzeth")
      :else (prettyprint n
                         "not Fizzeth nor Buzzeth"))))
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org4038ae5},fragile]{decomplect context (wicked pprint Buzz)}
 \begin{itemize}
\item Hotpatch \href{https://github.com/clojure/clojure/blob/b1b88dd25373a86e41310a525a21b497799dbbf2/src/clj/clojure/pprint/dispatch.clj\#L175}{pprint dispatcher} to
use \texttt{pprint-buzz} formatter for all Numbers!
\begin{verbatim}
(#'pp/use-method pp/simple-dispatch
                 java.lang.Number
                 pprint-buzz)
\end{verbatim}
\item Enjoy a nondestructive, hilarious FizzBuzz experience!
\begin{verbatim}
(doseq [n [1 3 5 15]] (pp/pprint n)) ;; see REPL :)
\end{verbatim}
\item This is a joke implementation of a serious idea\ldots{}
pretty-printing data is open, fully extensible, and
can be done (and undone) in a live runtime.
\end{itemize}
\end{frame}
\section{Suddenly, Transducers}
\label{sec:orgc14b7fb}
\begin{frame}[label={sec:org3b5440c}]{decomplect what, now? (Suddenly, Transducers.)}
You:
\begin{quote}
\emph{Uh, what more could we possibly decomplect?}
\end{quote}
Clojure:
\begin{quote}
(whatever, input -> whatever) -> (whatever, input -> whatever)
\end{quote}
Rich Hickey:
\begin{quote}
\uline{\emph{\href{https://www.youtube.com/watch?v=6mTbuzafcII\&t=1677s}{Seems like a good project for the bar, later on.}}}
\end{quote}
\end{frame}
\begin{frame}[label={sec:org9842793}]{decomplect what, now? (Suddenly, Transducers.)}
\begin{itemize}
\item Data source
\begin{itemize}
\item sequence, stream, channel, socket etc.
\end{itemize}
\item Data sink
\begin{itemize}
\item sequence, stream, channel, socket etc.
\end{itemize}
\item Data transformer
\begin{itemize}
\item function of any value -> any other value
\end{itemize}
\item Data transformation process
\begin{itemize}
\item mapping, filtering, reducing etc.
\end{itemize}
\item Some process control
\begin{itemize}
\item Transduce finite data (of course)
\item Transduce streams
\item With optional early termination in either case
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgcca840f},fragile]{decomplect whatever (some setup)}
 \begin{itemize}
\item Bring back the usual suspects (this is key\ldots{} reuse logic)
\begin{verbatim}
(ns transducery.buzz)

(def divisible? (comp zero? rem))

(defn basic-buzz [n]
  (cond
    (divisible? n 15) "FizzBuzz"
    (divisible? n 3) "Fizz"
    (divisible? n 5) "Buzz"
    :else n))
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgcbf7b8e},fragile]{decomplect Computation and \emph{Output} format (Demo 1)}
 \begin{itemize}
\item Separately define \emph{only} the transformation "xform"
\begin{verbatim}
(def fizz-buzz-xform
  (comp (map basic-buzz)
        (take 100))) ;; early termination
\end{verbatim}
\item Separately define \emph{only} input data
\begin{verbatim}
(def natural-nums (rest (range)))
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org41956be},fragile]{decomplect Computation and \emph{Output} format (Demo 1)}
 \begin{itemize}
\item Compose in various ways
\begin{itemize}
\item To produce a sequence
\begin{verbatim}
(transduce fizz-buzz-xform ;; calculator step
           conj ;; output method
           []   ;; output sink
           natural-nums) ;; input source
\end{verbatim}
\item To produce a string
\begin{verbatim}
(transduce fizz-buzz-xform
           str
           ""
           natural-nums)
\end{verbatim}
\item To produce a CSV string
\begin{verbatim}
(transduce (comp fizz-buzz-xform
                 (map #(str s "," %)))
           str
           ""
           natural-nums)
\end{verbatim}
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org2cc110a},fragile]{decomplect Computation and \emph{Output} format (Demo 1)}
 \begin{itemize}
\item Consider:
\begin{itemize}
\item Parts \emph{not} modified, though \emph{output} and/or \emph{xform} modded
\item Effort needed to reuse fizz-buzzes other than \texttt{basic-buzz}?
\end{itemize}
\item Try it!
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgd89be41},fragile]{decomplect Computation and \emph{Input} format (Demo 2)}
 \begin{itemize}
\item Setup
\begin{verbatim}
(ns transducery.buzz)
(def numbers-file
  "Plaintext file containing numbers in some format."
  "/tmp/deleteme-spat-by-clj-fizz-buzz-demo.txt")
#_(spit numbers-file
        (clojure.string/join "\n" (range 1 10001)))
#_(slurp numbers-file)
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org2a66945},fragile]{decomplect Computation and \emph{Input} format (Demo 2)}
 \begin{itemize}
\item Transduce! Now, over file data.
\begin{verbatim}
(transduce (comp (map #(Integer/parseInt %))
                 fizz-buzz-xform) ;; calculator step
           conj ;; output method
           []   ;; output sink
           (clojure.string/split-lines
            (slurp numbers-file))) ;; input source
\end{verbatim}
\item Split-lines and file slurpin' still complected!!!
\begin{itemize}
\item decomplect clues in Tim Baldridge's (excellent) \uline{\href{https://tbaldridge.pivotshare.com/categories/transducers/2426/media}{tutorials}}
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org5aad46d},fragile]{decomplected xform as a standalone calculator (Demo 3)}
 \begin{itemize}
\item The xform can still calculate just a single item
\begin{verbatim}
(ns transducery.buzz)
((fizz-buzz-xform conj) [] 3) ;; => ["Fizz"]
((fizz-buzz-xform str) "" 3) ;; => "Fizz"
((fizz-buzz-xform str) "" 1) ;; => "1"
((fizz-buzz-xform (fn [_ out] out)) nil 3) ;; "Fizz"
((fizz-buzz-xform (fn [_ out] out)) nil 1) ;; 1
\end{verbatim}
\item Meditate:
\begin{itemize}
\item The transducer's mandate of \emph{a la carte} re-composition \emph{demands}
that \emph{all} the new pulling apart \emph{must be fully compatible}
with \emph{all} the old pulling apart.
\end{itemize}
\end{itemize}
\end{frame}
\section{Fin}
\label{sec:orga1c7f74}
\begin{frame}[label={sec:orgbdcbc83},fragile]{So Long And Thanks For All The \(\lambda\)s}
 \begin{itemize}
\item Acknowledgements
\begin{verse}
To everyone who reviewed drafts, gave\\
feedback, ideas, encouragement, time\ldots{}\\
\ldots{} friends, fellow Clojurian Slack-ers,\\
sundry gentlenerds, one's better half,\\
and you dear reader.\\
\vspace*{1em}
May the Source be with you.\\
\vspace*{1em}
\(\lambda\) \texttt{<3}\\
\end{verse}
\item Blog post: \uline{\href{https://www.evalapply.org/posts/n-ways-to-fizzbuzz-in-clojure/}{evalapply.org/posts/n-ways-to-fizzbuzz-in-clojure}}
\item Email complaints or fizzbuzzes to
\begin{itemize}
\item fizzbuzz@evalapply.org
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org5b1e96f}]{Buzz}
Ideas on deck, to put self on the hook\ldots{}

\begin{itemize}
\item[{$\square$}] curried fizzbuzz (like Ring libraries),

\item[{$\square$}] concurrent fizzbuzz (with agents)

\item[{$\square$}] advanced transducing fizzbuzz
(xform all the fizz-buzzes in all ways)

\item[{$\square$}] Maaaybe re-do Rich's ants sim
4 species of, ah, ConcurrAnts:
FizzAnt, BuzzAnt, FizzBuzzAnt, IdentiAnt

\item[{$\square$}] Outside of clojure.core?
maaybe core.async if not too contrived
\end{itemize}
\end{frame}
\end{document}
